# Programming and Data Analysis

> Dataframe Wrangling with Pandas

Kuo, Yao-Jen <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com/)

In [1]:
from datetime import date
from datetime import timedelta
import urllib.error
import re
import pandas as pd

## About `pandas`

## What is `pandas`?

> Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures similar to R data.frame objects, statistical functions, and much more.

Source: <https://github.com/pandas-dev/pandas>

## Why `pandas`?

Python used to have a weak spot in its analysis capability due to it did not have an appropriate structure handling the common tabular datasets. Pythonists had to switch to a more data-centric language like R or Matlab during the analysis stage until the presence of `pandas`.

## Import Pandas with `import` command

Pandas is officially aliased as `pd`.

In [2]:
import pandas as pd

## If Pandas is not installed, we will encounter a `ModuleNotFoundError`

```
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
ModuleNotFoundError: No module named 'pandas'
```

## Use `pip install` at Terminal to install pandas

```bash
pip install pandas
```

## Check version and its installation file path

- `__version__` attribute
- `__file__` attribute

In [3]:
print(pd.__version__)
print(pd.__file__)

1.2.4
/Users/kuoyaojen/opt/miniconda3/envs/pyds/lib/python3.8/site-packages/pandas/__init__.py

## What does `pandas` mean?

![](https://media.giphy.com/media/46Zj6ze2Z2t4k/giphy.gif)

Source: <https://giphy.com/>

## Turns out its naming has nothing to do with panda the animal, it refers to three primary class customed by its author [Wes McKinney](https://wesmckinney.com/)

- **Pan**el(Deprecated since version 0.20.0)
- **Da**taFrame
- **S**eries

## In order to master `pandas`, it is vital to understand the relationships between `Index`, `ndarray`, `Series`, and `DataFrame`

- An `Index` and a `ndarray` assembles a `Series`.
- A couple of `Series` that sharing the same `Index` can then form a `DataFrame`.

## `Index` from Pandas

The simplest way to create an `Index` is using `pd.Index()`.

In [4]:
prime_indices = pd.Index([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
type(prime_indices)

pandas.core.indexes.numeric.Int64Index

## An `Index` is like a combination of `tuple` and `set`

In [5]:
# immutable
prime_indices = pd.Index([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
try:
    prime_indices[-1] = 31
except TypeError as e:
    print(e)

Index does not support mutable operations

In [6]:
# Index has the characteristics of a set
odd_indices = pd.Index(range(1, 30, 2))
print(prime_indices.intersection(odd_indices))         # prime_indices & odd_indices
print(prime_indices.union(odd_indices))                # prime_indices | odd_indices
print(prime_indices.symmetric_difference(odd_indices)) # prime_indices ^ odd_indices
print(prime_indices.difference(odd_indices))
print(odd_indices.difference(prime_indices))

Int64Index([3, 5, 7, 11, 13, 17, 19, 23, 29], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29], dtype='int64')
Int64Index([1, 2, 9, 15, 21, 25, 27], dtype='int64')
Int64Index([2], dtype='int64')
Int64Index([1, 9, 15, 21, 25, 27], dtype='int64')

## `Series` from Pandas

The simplest way to create a `Series` is using `pd.Series()`.

In [7]:
prime_series = pd.Series([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
print(type(prime_series))
print(prime_series)

<class 'pandas.core.series.Series'>
0     2
1     3
2     5
3     7
4    11
5    13
6    17
7    19
8    23
9    29
dtype: int64

## A `Series` is a combination of `Index` and `ndarray`

In [8]:
print(type(prime_series.index))
print(type(prime_series.values))

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'numpy.ndarray'>

## The index of a `Series` can be customized

In [9]:
prime_series = pd.Series([2, 3, 5, 7, 11, 13, 17, 19, 23, 29],
                        index=range(1, 11))
prime_series

1      2
2      3
3      5
4      7
5     11
6     13
7     17
8     19
9     23
10    29
dtype: int64

In [10]:
prime_series = pd.Series([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
prime_series.index = range(1, 11)
prime_series

1      2
2      3
3      5
4      7
5     11
6     13
7     17
8     19
9     23
10    29
dtype: int64

## Indexing a `Series`

Indexing via index positions or index labels.

In [11]:
prime_series = pd.Series([2, 3, 5, 7, 11],
                        index=["1st", "2nd", "3rd", "4th", "5th"])
print(prime_series[-1])
print(prime_series["5th"])

11
11

## Slicing a `Series`

Slicing via index positions excludes `stop`, while slicing via index labels includes `stop`.

In [12]:
print(prime_series[:2])
print(prime_series["1st":"3rd"])

1st    2
2nd    3
dtype: int64
1st    2
2nd    3
3rd    5
dtype: int64

## A `Series` contains a `ndarray` therefore they can be manipulated in the same way 

- Vectorization and broadcasting.
- Fancy indexing.
- Boolean indexing.

In [13]:
# Vectorization and broadcasting
prime_series**2

1st      4
2nd      9
3rd     25
4th     49
5th    121
dtype: int64

In [14]:
# Fancy indexing
print(prime_series[[0, 1, 4]])
print(prime_series[["1st", "2nd", "5th"]])

1st     2
2nd     3
5th    11
dtype: int64
1st     2
2nd     3
5th    11
dtype: int64

In [15]:
# Boolean indexing
prime_series[prime_series % 2 == 1]

2nd     3
3rd     5
4th     7
5th    11
dtype: int64

## `DataFrame` from Pandas

The simplest way to create a `DataFrame` is using `pd.DataFrame()`.

In [16]:
# column-wise
movie_df = pd.DataFrame()
movie_df["title"] = ["The Shawshank Redemption", "The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
movie_df["imdb_rating"] = [9.3, 9.0, 8.9, 8.8, 8.7]
type(movie_df)

pandas.core.frame.DataFrame

In [17]:
movie_df

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

## `DataFrame` from Pandas

Creating a `DataFrame` with a `dict`.

In [18]:
# column-wise
movie_dict = {
    "title": ["The Shawshank Redemption", "The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"],
    "imdb_rating": [9.3, 9.0, 8.9, 8.8, 8.7]
}
movie_df = pd.DataFrame(movie_dict)
type(movie_df)

pandas.core.frame.DataFrame

In [19]:
movie_df

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

## `DataFrame` from Pandas

Creating a `DataFrame` with a `list` of dictionaries.

In [20]:
# row-wise
movie_list = [
    {"title": "The Shawshank Redemption", "imdb_rating": 9.3},
    {"title": "The Dark Knight", "imdb_rating": 9.0},
    {"title": "Schindler's List", "imdb_rating": 8.9},
    {"title": "Forrest Gump", "imdb_rating": 8.8},
    {"title": "Inception", "imdb_rating": 8.7}
]
movie_df = pd.DataFrame(movie_list)
type(movie_df)

pandas.core.frame.DataFrame

In [21]:
movie_df

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

## A `DataFrame` is a combination of multiple `Series` sharing the same `Index`

In [22]:
print(type(movie_df.index))
print(type(movie_df["title"]))
print(type(movie_df["imdb_rating"]))

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

## Review of the definition of modern data science

> Modern data science is a huge field, it invovles applications and tools like importing, tidying, transformation, visualization, modeling, and communication. Surrounding all these is programming.

![Imgur](https://i.imgur.com/din6Ig6.png)

Source: [R for Data Science](https://r4ds.had.co.nz/)

## Key functionalities analysts rely on `pandas` are

- Importing
- Tidying
- Transforming

## Tidying and transforming together is also known as WRANGLING

![](https://media.giphy.com/media/MnlZWRFHR4xruE4N2Z/giphy.gif)

Source: <https://giphy.com>

## Importing

## `pandas` has massive functions importing tabular data

- Flat text file
- Database table
- Spreadsheet
- JSON
- HTML `<table></table>` tags
- ...etc.

Source: <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>

## Using `read_csv` function for flat text files

In [23]:
def get_latest_daily_report():
    data_date = date.today()
    day_delta = timedelta(days=1)
    while True:
        data_date_str = date.strftime(data_date, '%m-%d-%Y')
        print("Try importing {} data...".format(data_date_str))
        daily_report_url = "https://raw.githubusercontent.com\
/CSSEGISandData/COVID-19/master\
/csse_covid_19_data/csse_covid_19_daily_reports/{}.csv".format(data_date_str)
        try:
            daily_report = pd.read_csv(daily_report_url)
            print("Successfully imported {} data!".format(data_date_str))
            break
        except urllib.error.HTTPError:
            data_date -= day_delta
    return daily_report

In [24]:
daily_report = get_latest_daily_report()

Try importing 12-09-2021 data...
Try importing 12-08-2021 data...
Successfully imported 12-08-2021 data!

## The `data` folder of our environment

[classroom-programming-and-data-analysis/data](https://mybinder.org/v2/gh/datainpoint/classroom-programming-and-data-analysis/HEAD?labpath=data)

## Using `read_sql` function for database tables

```python
import sqlite3

conn = sqlite3.connect('YOUR_DATABASE.db')
sql_query = """
SELECT * 
  FROM YOUR_TABLE
 LIMIT 10;
"""
pd.read_sql(sql_query, conn)
```

## Using `read_excel` function for spreadsheets

```python
excel_file_path = "PATH/TO/YOUR/EXCEL/FILE"
pd.read_excel(excel_file_path)
```

## Using `read_json` function for JSON

```python
json_file_path = "PATH/TO/YOUR/JSON/FILE"
pd.read_json(json_file_path)
```

## What is JSON?

> JSON (JavaScript Object Notation) is a lightweight data-interchange format. JSON is built on two structures:
>
> A collection of name/value pairs. In various languages, this is realized as an object, record, struct, dictionary, hash table, keyed list, or associative array. An ordered list of values. In most languages, this is realized as an array, vector, list, or sequence.

Source: <https://www.json.org/json-en.html>

## Two flavors of tabular data

- Row-based JSON.
- Column-based JSON.

## Using `read_html` function for HTML `<table></table>` tags

> The `<table>` tag defines an HTML table. An HTML table consists of one `<table>` element and one or more `<tr>`, `<th>`, and `<td>` elements. The `<tr>` element defines a table row, the `<th>` element defines a table header, and the `<td>` element defines a table cell.

Source: <https://www.w3schools.com/default.asp>

In [25]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
print(type(html_tables))
print(len(html_tables))

<class 'list'>
1

In [26]:
html_tables[0]

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 教父第二集 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...,...
245,NaN,246. 96 (2018),8.0,12345678910 NOT YET RELEASED Seen,NaN
246,NaN,247. 卡比莉亞之夜 (1957),8.0,12345678910 NOT YET RELEASED Seen,NaN
247,NaN,248. 公主新娘 (1987),8.0,12345678910 NOT YET RELEASED Seen,NaN
248,NaN,249. 巴黎，德州 (1984),8.0,12345678910 NOT YET RELEASED Seen,NaN
249,NaN,250. Ratsasan (2018),8.0,12345678910 NOT YET RELEASED Seen,NaN

## Basic attributes and methods

## Basic attributes of a `DataFrame` object

- `shape`
- `dtypes`
- `index`
- `columns`

In [27]:
print(daily_report.shape)
print(daily_report.dtypes)
print(daily_report.index)
print(daily_report.columns)

(4006, 14)
FIPS                   float64
Admin2                  object
Province_State          object
Country_Region          object
Last_Update             object
Lat                    float64
Long_                  float64
Confirmed                int64
Deaths                   int64
Recovered              float64
Active                 float64
Combined_Key            object
Incident_Rate          float64
Case_Fatality_Ratio    float64
dtype: object
RangeIndex(start=0, stop=4006, step=1)
Index(['FIPS', 'Admin2', 'Province_State', 'Country_Region', 'Last_Update',
       'Lat', 'Long_', 'Confirmed', 'Deaths', 'Recovered', 'Active',
       'Combined_Key', 'Incident_Rate', 'Case_Fatality_Ratio'],
      dtype='object')

## Basic methods of a `DataFrame` object

- `head(n)`
- `tail(n)`
- `describe()`
- `info()`
- `set_index()`
- `reset_index()`

## `head(n)` returns the top n observations with header

In [28]:
daily_report.head() # n is default to 5

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2021-12-09 04:22:49,33.93911,67.709953,157542,7317,NaN,NaN,Afghanistan,404.697441,4.644476
1,NaN,NaN,NaN,Albania,2021-12-09 04:22:49,41.15330,20.168300,202641,3126,NaN,NaN,Albania,7041.524776,1.542630
2,NaN,NaN,NaN,Algeria,2021-12-09 04:22:49,28.03390,1.659600,212047,6122,NaN,NaN,Algeria,483.562044,2.887096
3,NaN,NaN,NaN,Andorra,2021-12-09 04:22:49,42.50630,1.521800,18815,133,NaN,NaN,Andorra,24351.258655,0.706883
4,NaN,NaN,NaN,Angola,2021-12-09 04:22:49,-11.20270,17.873900,65332,1735,NaN,NaN,Angola,198.781316,2.655666

## `tail(n)` returns the bottom n observations with header

In [29]:
daily_report.tail(3)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4003,NaN,NaN,NaN,Yemen,2021-12-09 04:22:49,15.552727,48.516388,10047,1956,NaN,NaN,Yemen,33.685411,19.468498
4004,NaN,NaN,NaN,Zambia,2021-12-09 04:22:49,-13.133897,27.849332,210436,3668,NaN,NaN,Zambia,1144.672017,1.743048
4005,NaN,NaN,NaN,Zimbabwe,2021-12-09 04:22:49,-19.015438,29.154857,150628,4720,NaN,NaN,Zimbabwe,1013.447755,3.133548

## `describe()` returns the descriptive summary for numeric columns

In [30]:
daily_report.describe()

,FIPS,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
count,3268.000000,3916.000000,3916.000000,4.006000e+03,4006.000000,0.0,0.0,3915.000000,3964.000000
mean,32405.943390,35.804041,-71.352046,6.685715e+04,1317.823265,NaN,NaN,14295.344321,2.811766
std,18056.381177,13.248365,54.904663,3.713593e+05,7253.747542,NaN,NaN,5723.693073,46.395049
min,60.000000,-52.368000,-178.116500,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000
25%,19048.500000,33.204471,-96.600814,1.905250e+03,30.000000,NaN,NaN,11541.032519,1.152276
50%,30068.000000,37.898574,-86.773508,5.352500e+03,88.500000,NaN,NaN,15515.023968,1.623308
75%,47041.500000,42.178547,-77.393577,2.180900e+04,307.750000,NaN,NaN,17993.447894,2.226409
max,99999.000000,71.706900,178.065000,9.000391e+06,154571.000000,NaN,NaN,56541.670487,2796.551724

## `info()` returns the concise information of the dataframe

In [31]:
daily_report.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4006 entries, 0 to 4005
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FIPS                 3268 non-null   float64
 1   Admin2               3272 non-null   object
 2   Province_State       3832 non-null   object
 3   Country_Region       4006 non-null   object
 4   Last_Update          4006 non-null   object
 5   Lat                  3916 non-null   float64
 6   Long_                3916 non-null   float64
 7   Confirmed            4006 non-null   int64
 8   Deaths               4006 non-null   int64
 9   Recovered            0 non-null      float64
 10  Active               0 non-null      float64
 11  Combined_Key         4006 non-null   object
 12  Incident_Rate        3915 non-null   float64
 13  Case_Fatality_Ratio  3964 non-null   float64
dtypes: float64(7), int64(2), object(5)
memory usage: 438.3+ KB

## `set_index()` replaces current `Index` with a specific variable

In [32]:
daily_report.set_index('Combined_Key')

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
Combined_Key,,,,,,,,,,,,,
Afghanistan,NaN,NaN,NaN,Afghanistan,2021-12-09 04:22:49,33.939110,67.709953,157542,7317,NaN,NaN,404.697441,4.644476
Albania,NaN,NaN,NaN,Albania,2021-12-09 04:22:49,41.153300,20.168300,202641,3126,NaN,NaN,7041.524776,1.542630
Algeria,NaN,NaN,NaN,Algeria,2021-12-09 04:22:49,28.033900,1.659600,212047,6122,NaN,NaN,483.562044,2.887096
Andorra,NaN,NaN,NaN,Andorra,2021-12-09 04:22:49,42.506300,1.521800,18815,133,NaN,NaN,24351.258655,0.706883
Angola,NaN,NaN,NaN,Angola,2021-12-09 04:22:49,-11.202700,17.873900,65332,1735,NaN,NaN,198.781316,2.655666
...,...,...,...,...,...,...,...,...,...,...,...,...,...
Vietnam,NaN,NaN,NaN,Vietnam,2021-12-09 04:22:49,14.058324,108.277199,1352122,26930,NaN,NaN,1389.091518,1.991684
West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2021-12-09 04:22:49,31.952200,35.233200,462958,4823,NaN,NaN,9075.088172,1.041779
Yemen,NaN,NaN,NaN,Yemen,2021-12-09 04:22:49,15.552727,48.516388,10047,1956,NaN,NaN,33.685411,19.468498
Zambia,NaN,NaN,NaN,Zambia,2021-12-09 04:22:49,-13.133897,27.849332,210436,3668,NaN,NaN,1144.672017,1.743048
Zimbabwe,NaN,NaN,NaN,Zimbabwe,2021-12-09 04:22:49,-19.015438,29.154857,150628,4720,NaN,NaN,1013.447755,3.133548

## `reset_index()` resets current `Index` with default `RangeIndex`

In [33]:
daily_report.set_index('Combined_Key').reset_index()

,Combined_Key,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
0,Afghanistan,NaN,NaN,NaN,Afghanistan,2021-12-09 04:22:49,33.939110,67.709953,157542,7317,NaN,NaN,404.697441,4.644476
1,Albania,NaN,NaN,NaN,Albania,2021-12-09 04:22:49,41.153300,20.168300,202641,3126,NaN,NaN,7041.524776,1.542630
2,Algeria,NaN,NaN,NaN,Algeria,2021-12-09 04:22:49,28.033900,1.659600,212047,6122,NaN,NaN,483.562044,2.887096
3,Andorra,NaN,NaN,NaN,Andorra,2021-12-09 04:22:49,42.506300,1.521800,18815,133,NaN,NaN,24351.258655,0.706883
4,Angola,NaN,NaN,NaN,Angola,2021-12-09 04:22:49,-11.202700,17.873900,65332,1735,NaN,NaN,198.781316,2.655666
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4001,Vietnam,NaN,NaN,NaN,Vietnam,2021-12-09 04:22:49,14.058324,108.277199,1352122,26930,NaN,NaN,1389.091518,1.991684
4002,West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2021-12-09 04:22:49,31.952200,35.233200,462958,4823,NaN,NaN,9075.088172,1.041779
4003,Yemen,NaN,NaN,NaN,Yemen,2021-12-09 04:22:49,15.552727,48.516388,10047,1956,NaN,NaN,33.685411,19.468498
4004,Zambia,NaN,NaN,NaN,Zambia,2021-12-09 04:22:49,-13.133897,27.849332,210436,3668,NaN,NaN,1144.672017,1.743048
4005,Zimbabwe,NaN,NaN,NaN,Zimbabwe,2021-12-09 04:22:49,-19.015438,29.154857,150628,4720,NaN,NaN,1013.447755,3.133548

## Basic Wrangling

## Basic wrangling is like writing SQL queries

- Selecting: `SELECT FROM`
- Filtering: `WHERE`
- Subset: `SELECT FROM WHERE`

## Basic wrangling is like writing SQL queries(cont'd)

- Indexing
- Sorting: `ORDER BY`
- Deriving
- Summarizing
- Summarizing and Grouping: `GROUP BY`

## Selecting a column as `Series`

In [34]:
print(daily_report['Country_Region'])
print(type(daily_report['Country_Region']))

0              Afghanistan
1                  Albania
2                  Algeria
3                  Andorra
4                   Angola
               ...
4001               Vietnam
4002    West Bank and Gaza
4003                 Yemen
4004                Zambia
4005              Zimbabwe
Name: Country_Region, Length: 4006, dtype: object
<class 'pandas.core.series.Series'>

## Selecting a column as `DataFrame`

In [35]:
print(type(daily_report[['Country_Region']]))
daily_report[['Country_Region']]

<class 'pandas.core.frame.DataFrame'>

          Country_Region
0            Afghanistan
1                Albania
2                Algeria
3                Andorra
4                 Angola
...                  ...
4001             Vietnam
4002  West Bank and Gaza
4003               Yemen
4004              Zambia
4005            Zimbabwe

[4006 rows x 1 columns]

## Selecting multiple columns as `DataFrame`, for sure

In [36]:
cols = ['Country_Region', 'Confirmed', 'Deaths']
daily_report[cols]

          Country_Region  Confirmed  Deaths
0            Afghanistan     157542    7317
1                Albania     202641    3126
2                Algeria     212047    6122
3                Andorra      18815     133
4                 Angola      65332    1735
...                  ...        ...     ...
4001             Vietnam    1352122   26930
4002  West Bank and Gaza     462958    4823
4003               Yemen      10047    1956
4004              Zambia     210436    3668
4005            Zimbabwe     150628    4720

[4006 rows x 3 columns]

## Filtering rows with conditional statements

In [37]:
is_taiwan = daily_report['Country_Region'] == 'Taiwan*'
daily_report[is_taiwan]

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
663,NaN,NaN,NaN,Taiwan*,2021-12-09 04:22:49,23.7,121.0,16688,848,NaN,NaN,Taiwan*,70.068261,5.081496

## Subsetting columns and rows simultaneously

In [38]:
cols_to_select = ['Country_Region', 'Confirmed', 'Deaths']
rows_to_filter = daily_report['Country_Region'] == 'Taiwan*'
daily_report[rows_to_filter][cols_to_select]

    Country_Region  Confirmed  Deaths
663        Taiwan*      16688     848

## Indexing `DataFrame` with

- `loc[]`
- `iloc[]`

## `loc[]` is indexing `DataFrame` with `Index`

In [39]:
taiwan_row_index = daily_report[is_taiwan].index[0]
print(daily_report.loc[taiwan_row_index, ['Country_Region', 'Confirmed']]) # as Series
daily_report.loc[[taiwan_row_index], ['Country_Region', 'Confirmed']] # as DataFrame

Country_Region    Taiwan*
Confirmed           16688
Name: 663, dtype: object

    Country_Region  Confirmed
663        Taiwan*      16688

## `iloc[]` is indexing `DataFrame` with absolute position

In [40]:
print(daily_report.iloc[taiwan_row_index, [3, 7]]) # as Series
daily_report.iloc[[taiwan_row_index], [3, 7]] # as DataFrame

Country_Region    Taiwan*
Confirmed           16688
Name: 663, dtype: object

    Country_Region  Confirmed
663        Taiwan*      16688

## Sorting `DataFrame` with

- `sort_values`
- `sort_index`

## `sort_values` sorts `DataFrame` with specific columns

In [41]:
daily_report.sort_values(['Country_Region', 'Confirmed'])

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2021-12-09 04:22:49,33.939110,67.709953,157542,7317,NaN,NaN,Afghanistan,404.697441,4.644476
1,NaN,NaN,NaN,Albania,2021-12-09 04:22:49,41.153300,20.168300,202641,3126,NaN,NaN,Albania,7041.524776,1.542630
2,NaN,NaN,NaN,Algeria,2021-12-09 04:22:49,28.033900,1.659600,212047,6122,NaN,NaN,Algeria,483.562044,2.887096
3,NaN,NaN,NaN,Andorra,2021-12-09 04:22:49,42.506300,1.521800,18815,133,NaN,NaN,Andorra,24351.258655,0.706883
4,NaN,NaN,NaN,Angola,2021-12-09 04:22:49,-11.202700,17.873900,65332,1735,NaN,NaN,Angola,198.781316,2.655666
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4001,NaN,NaN,NaN,Vietnam,2021-12-09 04:22:49,14.058324,108.277199,1352122,26930,NaN,NaN,Vietnam,1389.091518,1.991684
4002,NaN,NaN,NaN,West Bank and Gaza,2021-12-09 04:22:49,31.952200,35.233200,462958,4823,NaN,NaN,West Bank and Gaza,9075.088172,1.041779
4003,NaN,NaN,NaN,Yemen,2021-12-09 04:22:49,15.552727,48.516388,10047,1956,NaN,NaN,Yemen,33.685411,19.468498
4004,NaN,NaN,NaN,Zambia,2021-12-09 04:22:49,-13.133897,27.849332,210436,3668,NaN,NaN,Zambia,1144.672017,1.743048
4005,NaN,NaN,NaN,Zimbabwe,2021-12-09 04:22:49,-19.015438,29.154857,150628,4720,NaN,NaN,Zimbabwe,1013.447755,3.133548

## `sort_index` sorts `DataFrame` with the `Index` of `DataFrame`

In [42]:
daily_report.sort_index(ascending=False)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4005,NaN,NaN,NaN,Zimbabwe,2021-12-09 04:22:49,-19.015438,29.154857,150628,4720,NaN,NaN,Zimbabwe,1013.447755,3.133548
4004,NaN,NaN,NaN,Zambia,2021-12-09 04:22:49,-13.133897,27.849332,210436,3668,NaN,NaN,Zambia,1144.672017,1.743048
4003,NaN,NaN,NaN,Yemen,2021-12-09 04:22:49,15.552727,48.516388,10047,1956,NaN,NaN,Yemen,33.685411,19.468498
4002,NaN,NaN,NaN,West Bank and Gaza,2021-12-09 04:22:49,31.952200,35.233200,462958,4823,NaN,NaN,West Bank and Gaza,9075.088172,1.041779
4001,NaN,NaN,NaN,Vietnam,2021-12-09 04:22:49,14.058324,108.277199,1352122,26930,NaN,NaN,Vietnam,1389.091518,1.991684
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,NaN,NaN,NaN,Angola,2021-12-09 04:22:49,-11.202700,17.873900,65332,1735,NaN,NaN,Angola,198.781316,2.655666
3,NaN,NaN,NaN,Andorra,2021-12-09 04:22:49,42.506300,1.521800,18815,133,NaN,NaN,Andorra,24351.258655,0.706883
2,NaN,NaN,NaN,Algeria,2021-12-09 04:22:49,28.033900,1.659600,212047,6122,NaN,NaN,Algeria,483.562044,2.887096
1,NaN,NaN,NaN,Albania,2021-12-09 04:22:49,41.153300,20.168300,202641,3126,NaN,NaN,Albania,7041.524776,1.542630
0,NaN,NaN,NaN,Afghanistan,2021-12-09 04:22:49,33.939110,67.709953,157542,7317,NaN,NaN,Afghanistan,404.697441,4.644476

## Deriving new variables from `DataFrame`

- Simple operations
- `map` with a `dict`
- `map` with a function(or a lambda expression)

## Deriving new variable with simple operations

In [43]:
case_fatality_ratio = daily_report['Deaths'] / daily_report['Confirmed']
case_fatality_ratio

0       0.046445
1       0.015426
2       0.028871
3       0.007069
4       0.026557
          ...
4001    0.019917
4002    0.010418
4003    0.194685
4004    0.017430
4005    0.031335
Length: 4006, dtype: float64

## Deriving categorical from categorical with `map`

- Passing a `dict`
- Passing a function(or lambda expression)

In [44]:
# Passing a dict
country_name = {
    'Taiwan*': 'Taiwan'
}
daily_report_tw = daily_report[is_taiwan]
daily_report_tw['Country_Region'].map(country_name)

663    Taiwan
Name: Country_Region, dtype: object

In [45]:
# Passing a function
def replace_asterisk(x):
    if "*" in x:
        return x.replace("*", "")
    else:
        return x

daily_report['Country_Region'].map(replace_asterisk)[taiwan_row_index]

'Taiwan'

In [46]:
# Passing a lambda expression)
daily_report['Country_Region'].map(lambda x: x.replace("*", "") if "*" in x else x)[taiwan_row_index]

'Taiwan'

## Summarizing `DataFrame` with aggregate methods

In [47]:
daily_report['Confirmed'].sum()

267829762

## Summarizing and grouping `DataFrame` with aggregate methods

In [48]:
daily_report.groupby('Country_Region')['Confirmed'].sum()

Country_Region
Afghanistan            157542
Albania                202641
Algeria                212047
Andorra                 18815
Angola                  65332
                       ...
Vietnam               1352122
West Bank and Gaza     462958
Yemen                   10047
Zambia                 210436
Zimbabwe               150628
Name: Confirmed, Length: 196, dtype: int64

## Advanced Wrangling

## Other common wranglings including

- Dealing with missing values.
- Dealing with text values.
- Reshaping dataframes.
- Concatenating, merging and joining dataframes.

## Dealing with missing values

- Using `isnull` or `notnull` to check if `np.nan` exists.
- Using `dropna` to drop rows with `np.nan`.
- Using `fillna` to fill `np.nan` with specific values.

In [49]:
print(daily_report['Province_State'].size)
print(daily_report['Province_State'].isnull().sum())
print(daily_report['Province_State'].notnull().sum())

4006
174
3832

In [50]:
print(daily_report.dropna().shape)
print(daily_report['FIPS'].fillna(0))

(0, 14)
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
4001    0.0
4002    0.0
4003    0.0
4004    0.0
4005    0.0
Name: FIPS, Length: 4006, dtype: float64

## Summarizing text columns

- `unique`
- `nunique`
- `value_counts`

In [51]:
print(daily_report['Country_Region'].nunique())
print(daily_report['Country_Region'].unique())

196
['Afghanistan' 'Albania' 'Algeria' 'Andorra' 'Angola'
 'Antigua and Barbuda' 'Argentina' 'Armenia' 'Australia' 'Austria'
 'Azerbaijan' 'Bahamas' 'Bahrain' 'Bangladesh' 'Barbados' 'Belarus'
 'Belgium' 'Belize' 'Benin' 'Bhutan' 'Bolivia' 'Bosnia and Herzegovina'
 'Botswana' 'Brazil' 'Brunei' 'Bulgaria' 'Burkina Faso' 'Burma' 'Burundi'
 'Cabo Verde' 'Cambodia' 'Cameroon' 'Canada' 'Central African Republic'
 'Chad' 'Chile' 'China' 'Colombia' 'Comoros' 'Congo (Brazzaville)'
 'Congo (Kinshasa)' 'Costa Rica' "Cote d'Ivoire" 'Croatia' 'Cuba' 'Cyprus'
 'Czechia' 'Denmark' 'Diamond Princess' 'Djibouti' 'Dominica'
 'Dominican Republic' 'Ecuador' 'Egypt' 'El Salvador' 'Equatorial Guinea'
 'Eritrea' 'Estonia' 'Eswatini' 'Ethiopia' 'Fiji' 'Finland' 'France'
 'Gabon' 'Gambia' 'Georgia' 'Germany' 'Ghana' 'Greece' 'Grenada'
 'Guatemala' 'Guinea' 'Guinea-Bissau' 'Guyana' 'Haiti' 'Holy See'
 'Honduras' 'Hungary' 'Iceland' 'India' 'Indonesia' 'Iran' 'Iraq'
 'Ireland' 'Israel' 'Italy' 'Jamaica' 'Japan' 'Jordan' 'Kazakhstan'
 'Kenya' 'Kiribati' 'Korea, South' 'Kosovo' 'Kuwait' 'Kyrgyzstan' 'Laos'
 'Latvia' 'Lebanon' 'Lesotho' 'Liberia' 'Libya' 'Liechtenstein'
 'Lithuania' 'Luxembourg' 'MS Zaandam' 'Madagascar' 'Malawi' 'Malaysia'
 'Maldives' 'Mali' 'Malta' 'Marshall Islands' 'Mauritania' 'Mauritius'
 'Mexico' 'Micronesia' 'Moldova' 'Monaco' 'Mongolia' 'Montenegro'
 'Morocco' 'Mozambique' 'Namibia' 'Nepal' 'Netherlands' 'New Zealand'
 'Nicaragua' 'Niger' 'Nigeria' 'North Macedonia' 'Norway' 'Oman'
 'Pakistan' 'Palau' 'Panama' 'Papua New Guinea' 'Paraguay' 'Peru'
 'Philippines' 'Poland' 'Portugal' 'Qatar' 'Romania' 'Russia' 'Rwanda'
 'Saint Kitts and Nevis' 'Saint Lucia' 'Saint Vincent and the Grenadines'
 'Samoa' 'San Marino' 'Sao Tome and Principe' 'Saudi Arabia' 'Senegal'
 'Serbia' 'Seychelles' 'Sierra Leone' 'Singapore' 'Slovakia' 'Slovenia'
 'Solomon Islands' 'Somalia' 'South Africa' 'South Sudan' 'Spain'
 'Sri Lanka' 'Sudan' 'Summer Olympics 2020' 'Suriname' 'Sweden'
 'Switzerland' 'Syria' 'Taiwan*' 'Tajikistan' 'Tanzania' 'Thailand'
 'Timor-Leste' 'Togo' 'Tonga' 'Trinidad and Tobago' 'Tunisia' 'Turkey'
 'US' 'Uganda' 'Ukraine' 'United Arab Emirates' 'United Kingdom' 'Uruguay'
 'Uzbekistan' 'Vanuatu' 'Venezuela' 'Vietnam' 'West Bank and Gaza' 'Yemen'
 'Zambia' 'Zimbabwe']

In [52]:
daily_report['Country_Region'].value_counts()

US                       3279
Russia                     83
Japan                      49
India                      37
Colombia                   34
                         ...
Guinea-Bissau               1
Armenia                     1
Sao Tome and Principe       1
Senegal                     1
Mauritius                   1
Name: Country_Region, Length: 196, dtype: int64

## Splitting strings with `str.split` as a `Series`

In [53]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
html_table = html_tables[0]
html_table.head()

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 教父第二集 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN

In [54]:
html_table['Rank & Title'].str.split()

0          [1., 刺激1995, (1994)]
1              [2., 教父, (1972)]
2           [3., 教父第二集, (1974)]
3            [4., 黑暗騎士, (2008)]
4            [5., 十二怒漢, (1957)]
                 ...
245          [246., 96, (2018)]
246      [247., 卡比莉亞之夜, (1957)]
247        [248., 公主新娘, (1987)]
248       [249., 巴黎，德州, (1984)]
249    [250., Ratsasan, (2018)]
Name: Rank & Title, Length: 250, dtype: object

## Splitting strings with `str.split` as a `DataFrame`

In [55]:
html_table['Rank & Title'].str.split(expand=True)

        0         1       2     3
0      1.    刺激1995  (1994)  None
1      2.        教父  (1972)  None
2      3.     教父第二集  (1974)  None
3      4.      黑暗騎士  (2008)  None
4      5.      十二怒漢  (1957)  None
..    ...       ...     ...   ...
245  246.        96  (2018)  None
246  247.    卡比莉亞之夜  (1957)  None
247  248.      公主新娘  (1987)  None
248  249.     巴黎，德州  (1984)  None
249  250.  Ratsasan  (2018)  None

[250 rows x 4 columns]

## Replacing strings with `str.replace`

In [56]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
ranks = split_dataframe[0].str.replace(".", '', regex=False)
ranks

0        1
1        2
2        3
3        4
4        5
      ...
245    246
246    247
247    248
248    249
249    250
Name: 0, Length: 250, dtype: object

In [57]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
years = split_dataframe[2].str.replace("\(|\)", '', regex=True)
years

0      1994
1      1972
2      1974
3      2008
4      1957
       ...
245    2018
246    1957
247    1987
248    1984
249    2018
Name: 2, Length: 250, dtype: object

## Testing for strings that match or contain a pattern with `str.contains`

In [58]:
print(html_table['Rank & Title'].str.contains('魔戒').sum())
html_table[html_table['Rank & Title'].str.contains('魔戒')]

3

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
6,NaN,7. 魔戒三部曲：王者再臨 (2003),8.9,12345678910 NOT YET RELEASED Seen,NaN
9,NaN,10. 魔戒首部曲：魔戒現身 (2001),8.8,12345678910 NOT YET RELEASED Seen,NaN
13,NaN,14. 魔戒二部曲：雙城奇謀 (2002),8.7,12345678910 NOT YET RELEASED Seen,NaN

## Two formats of a table

- Wide: data is presented with each different data variable in a separate column.
- Long: data is presented with one column containing all the values and another column listing the context of the value.

Source: <https://en.wikipedia.org/wiki/Wide_and_narrow_data>

## Wide, or unstacked data

In [59]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
wide_format = pd.read_html(request_url)[0]
wide_format

  Person  Age  Weight  Height
0    Bob   32     168     180
1  Alice   24     150     175
2  Steve   64     144     165

## Narrow, stacked, or long data

In [60]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
long_format = pd.read_html(request_url)[1]
long_format

  Person Variable  Value
0    Bob      Age     32
1    Bob   Weight    168
2    Bob   Height    180
3  Alice      Age     24
4  Alice   Weight    150
5  Alice   Height    175
6  Steve      Age     64
7  Steve   Weight    144
8  Steve   Height    165

## Reshaping dataframes from wide to long format with `pd.melt()`

In [61]:
pd.melt(wide_format, 
        id_vars="Person", value_vars=["Age", "Weight", "Height"],
        var_name="Variable", value_name="Value")

  Person Variable  Value
0    Bob      Age     32
1  Alice      Age     24
2  Steve      Age     64
3    Bob   Weight    168
4  Alice   Weight    150
5  Steve   Weight    144
6    Bob   Height    180
7  Alice   Height    175
8  Steve   Height    165

## Reshaping dataframes from long to wide format with `pivot()`

In [62]:
long_format.pivot(index="Person", columns="Variable", values="Value").reset_index().rename_axis(None, axis=1)

  Person  Age  Height  Weight
0  Alice   24     175     150
1    Bob   32     180     168
2  Steve   64     165     144

## A common problem is that a dataset where some of the column names are not names of variables, but values of a variable

In [63]:
ts_confirmed_global_url = "https://raw.githubusercontent.com/CSSEGISandData\
/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series\
/time_series_covid19_confirmed_global.csv"
ts_confirmed_global = pd.read_csv(ts_confirmed_global_url)
ts_confirmed_global

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,11/29/21,11/30/21,12/1/21,12/2/21,12/3/21,12/4/21,12/5/21,12/6/21,12/7/21,12/8/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,157260,157289,157359,157387,157412,157431,157445,157499,157508,157542
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,199750,199945,200173,200639,201045,201402,201730,201902,202295,202641
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,210344,210531,210723,210921,211112,211297,211469,211662,211859,212047
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,16712,17115,17426,17658,18010,18010,18010,18631,18815,18815
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,65155,65168,65183,65208,65223,65244,65259,65259,65301,65332
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
275,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,1224110,1238082,1252590,1266288,1280780,1294778,1309092,1323683,1337523,1352122
276,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,460053,460053,460799,461157,461467,461467,461467,462219,462621,462958
277,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,9995,10004,10006,10006,10020,10021,10025,10034,10043,10047
278,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,210150,210169,210195,210220,210262,210294,210312,210327,210374,210436
279,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,134226,134625,135337,136379,137441,138523,139046,139046,141601,150628

## We can pivot the columns into a new pair of variables

To describe that operation we need four parameters:

- The set of columns whose names are not values
- The set of columns whose names are values
- The name of the variable to move the column names to
- The name of the variable to move the column values to

## In this example, the four parameters are

- `id_vars`: `['Province/State', 'Country/Region', 'Lat', 'Long']`
- `value_vars`: The columns from `1/22/20` to the last column
- `var_name`: Let's name it `Date`
- `value_name`: Let's name it `Confirmed`

In [64]:
idVars = ['Province/State', 'Country/Region', 'Lat', 'Long']
ts_confirmed_global_long = pd.melt(ts_confirmed_global,
                                   id_vars=idVars,
                                   var_name='Date',
                                   value_name='Confirmed')
ts_confirmed_global_long

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
192355,NaN,Vietnam,14.058324,108.277199,12/8/21,1352122
192356,NaN,West Bank and Gaza,31.952200,35.233200,12/8/21,462958
192357,NaN,Yemen,15.552727,48.516388,12/8/21,10047
192358,NaN,Zambia,-13.133897,27.849332,12/8/21,210436
192359,NaN,Zimbabwe,-19.015438,29.154857,12/8/21,150628

## Concatenating, merging and joining dataframes

- `concat()` vertically or horizontally.
- `merge()` horizontally on column names.
- `join()` horizontally on index.

In [65]:
def get_top_rated_movies():
    request_url = "https://www.imdb.com/chart/top"
    html_tables = pd.read_html(request_url)
    html_table = html_tables[0]
    split_dataframe = html_table['Rank & Title'].str.split(expand=True)
    ranks = split_dataframe[0].str.replace(".", '', regex=False).values
    split_series = html_table['Rank & Title'].str.split()
    years, titles = list(), list()
    for lst in split_series:
        year = re.sub("\(|\)", '', lst[-1])
        title = " ".join(lst[1:-1])
        years.append(int(year))
        titles.append(title)
    ratings = html_table['IMDb Rating'].values
    out = pd.DataFrame()
    out['rank'] = ranks
    out['title'] = titles
    out['year'] = years
    out['rating'] = ratings
    return out

top_rated_movies = get_top_rated_movies()

In [66]:
batman_trilogy = top_rated_movies[top_rated_movies["title"].str.contains("蝙蝠俠|黑暗騎士", regex=True)]
batman_trilogy

    rank      title  year  rating
3      4       黑暗騎士  2008     9.0
71    72  黑暗騎士：黎明昇起  2012     8.3
136  137   蝙蝠俠：開戰時刻  2005     8.2

In [67]:
lord_of_the_rings_trilogy = top_rated_movies[top_rated_movies["title"].str.contains("魔戒", regex=False)]
lord_of_the_rings_trilogy

   rank       title  year  rating
6     7  魔戒三部曲：王者再臨  2003     8.9
9    10  魔戒首部曲：魔戒現身  2001     8.8
13   14  魔戒二部曲：雙城奇謀  2002     8.7

## Use `concat()` function to concatenate vertically or horizontally

In [68]:
pd.concat((batman_trilogy, lord_of_the_rings_trilogy))

    rank       title  year  rating
3      4        黑暗騎士  2008     9.0
71    72   黑暗騎士：黎明昇起  2012     8.3
136  137    蝙蝠俠：開戰時刻  2005     8.2
6      7  魔戒三部曲：王者再臨  2003     8.9
9     10  魔戒首部曲：魔戒現身  2001     8.8
13    14  魔戒二部曲：雙城奇謀  2002     8.7

In [69]:
pd.concat((batman_trilogy["title"], lord_of_the_rings_trilogy["title"]), axis=1)

         title       title
3         黑暗騎士         NaN
6          NaN  魔戒三部曲：王者再臨
9          NaN  魔戒首部曲：魔戒現身
13         NaN  魔戒二部曲：雙城奇謀
71   黑暗騎士：黎明昇起         NaN
136   蝙蝠俠：開戰時刻         NaN

In [70]:
pd.concat((batman_trilogy["title"].reset_index(drop=True),
           lord_of_the_rings_trilogy["title"].reset_index(drop=True)),
          axis=1)

       title       title
0       黑暗騎士  魔戒三部曲：王者再臨
1  黑暗騎士：黎明昇起  魔戒首部曲：魔戒現身
2   蝙蝠俠：開戰時刻  魔戒二部曲：雙城奇謀

In [71]:
left_df = top_rated_movies.loc[:9, ['title', 'year']]
right_df = top_rated_movies[top_rated_movies['title'].str.contains('魔戒')][['title', 'rating']].reset_index(drop=True)
left_df

        title  year
0      刺激1995  1994
1          教父  1972
2       教父第二集  1974
3        黑暗騎士  2008
4        十二怒漢  1957
5      辛德勒的名單  1993
6  魔戒三部曲：王者再臨  2003
7       黑色追緝令  1994
8       黃昏三鏢客  1966
9  魔戒首部曲：魔戒現身  2001

In [72]:
right_df

        title  rating
0  魔戒三部曲：王者再臨     8.9
1  魔戒首部曲：魔戒現身     8.8
2  魔戒二部曲：雙城奇謀     8.7

## Using `merge` function to join dataframes on columns

In [73]:
# default: inner join
pd.merge(left_df, right_df)

        title  year  rating
0  魔戒三部曲：王者再臨  2003     8.9
1  魔戒首部曲：魔戒現身  2001     8.8

In [74]:
# left join
pd.merge(left_df, right_df, how='left')

        title  year  rating
0      刺激1995  1994     NaN
1          教父  1972     NaN
2       教父第二集  1974     NaN
3        黑暗騎士  2008     NaN
4        十二怒漢  1957     NaN
5      辛德勒的名單  1993     NaN
6  魔戒三部曲：王者再臨  2003     8.9
7       黑色追緝令  1994     NaN
8       黃昏三鏢客  1966     NaN
9  魔戒首部曲：魔戒現身  2001     8.8

In [75]:
# right join
pd.merge(left_df, right_df, how='right')

        title    year  rating
0  魔戒三部曲：王者再臨  2003.0     8.9
1  魔戒首部曲：魔戒現身  2001.0     8.8
2  魔戒二部曲：雙城奇謀     NaN     8.7

## Using `join` method to join dataframes on index

In [76]:
# join dataframes on index
left_df.join(right_df, lsuffix='_x', rsuffix='_y')

      title_x  year     title_y  rating
0      刺激1995  1994  魔戒三部曲：王者再臨     8.9
1          教父  1972  魔戒首部曲：魔戒現身     8.8
2       教父第二集  1974  魔戒二部曲：雙城奇謀     8.7
3        黑暗騎士  2008         NaN     NaN
4        十二怒漢  1957         NaN     NaN
5      辛德勒的名單  1993         NaN     NaN
6  魔戒三部曲：王者再臨  2003         NaN     NaN
7       黑色追緝令  1994         NaN     NaN
8       黃昏三鏢客  1966         NaN     NaN
9  魔戒首部曲：魔戒現身  2001         NaN     NaN

In [77]:
left_df = left_df.set_index('title')
right_df = right_df.set_index('title')
# default: left join
left_df.join(right_df)

            year  rating
title
刺激1995      1994     NaN
教父          1972     NaN
教父第二集       1974     NaN
黑暗騎士        2008     NaN
十二怒漢        1957     NaN
辛德勒的名單      1993     NaN
魔戒三部曲：王者再臨  2003     8.9
黑色追緝令       1994     NaN
黃昏三鏢客       1966     NaN
魔戒首部曲：魔戒現身  2001     8.8

In [78]:
# inner join
left_df.join(right_df, how='inner')

            year  rating
title
魔戒三部曲：王者再臨  2003     8.9
魔戒首部曲：魔戒現身  2001     8.8

In [79]:
# right join
left_df.join(right_df, how='right')

              year  rating
title
魔戒三部曲：王者再臨  2003.0     8.9
魔戒首部曲：魔戒現身  2001.0     8.8
魔戒二部曲：雙城奇謀     NaN     8.7